miguel-sergio/esp32-smart-cooking-firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Compiler: optimize for size in all builds
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

# Compiler: full assertions in development; release overrides this to 0
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=2

# Logging: INFO in development; release overrides this to WARN
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Task watchdog: always enabled regardless of build type
CONFIG_ESP_TASK_WDT_EN=y

# Bluetooth Classic + Bluedroid + Blufi (M4-T1 — FR-07)
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_BLE_BLUFI_ENABLE=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# TLS: Mozilla CA bundle for OTA HTTPS certificate verification (FR-10, NFR-05)
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# TLS: enable ECDHE cipher suites required by modern servers (ngrok, Let's Encrypt)
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_RSA=y
CONFIG_MBEDTLS_KEY_EXCHANGE_ECDHE_ECDSA=y

# OTA: enable rollback support — new firmware must call mark_valid or bootloader reverts (NFR-05)
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
